package com.example.movieapplication.data;

import java.util.Arrays;
import java.util.LinkedHashMap;
import java.util.List;
import java.util.Map;

public class Theater {
    public static Map<String, List<String>> getTheaterMap(){
        Map<String, List<String>> regionMap = new LinkedHashMap<>();
        regionMap.put("서울", Arrays.asList(
                "가산디지털", "가양", "강동", "건대입구", "김포공항",
                "노원", "도곡", "독산", "서울대입구", "수락산",
                "수유", "신도림", "신림", "에비뉴엘", "영등포",
                "용산", "월드타워", "은평", "청량리", "홍대입구"
        ));
        regionMap.put("경기/인천", Arrays.asList(
                "광교", "광명(광명사거리)", "광명아울렛", "광주터미널", "구리아울렛", "동탄", "라페스타", "마석",
                "병점", "별내", "부천(신중동역)", "부평", "부평갈산", "부평역사", "북수원(천천동)", "산본피트인",
                "서수원", "성남중앙(신흥역)", "센트럴락", "송도(타임빌라스)", "송탄", "수원(수원역)", "수지",
                "시화(정왕역)", "시흥장현", "안산", "안산고잔", "안성", "안양(안양역)", "안양일번가", "용인기흥",
                "용인역북", "위례", "의정부민락", "인덕원", "인천아시아드", "인천터미널", "진접", "파주롯데아울렛",
                "파주운정", "파주야당", "판교(창조경제밸리)", "평촌(범계역)", "하남미사", "향남"
        ));
        regionMap.put("충청/대전", Arrays.asList(
                "당진", "대전(백화점)", "대전관저", "대전센트럴", "서산", "서청주(아울렛)", "아산터미널",
                "오송", "천안불당", "천안청당", "청주용암", "충주(모다아울렛)"
        ));
        regionMap.put("전라/광주", Arrays.asList(
                "광주(백화점)", "광주광산", "광주첨단", "군산나운", "군산몰", "수완(아울렛)", "익산모현",
                "전주(백화점)", "전주송천", "전주평화", "충장로"
        ));
        regionMap.put("경북/대구", Arrays.asList(
                "경주황성", "구미공단", "대구광장", "대구율하", "대구현풍", "동성로", "상인", "상주",
                "성서", "영주", "영천", "포항", "프리미엄구미센트럴", "프리미엄안동", "프리미엄칠곡"
        ));
        regionMap.put("경남/부산/울산", Arrays.asList(
                "거창", "광복", "김해부원", "김해아울렛(장유)", "동래", "동부산아울렛", "마산(합성동)", "부산명지",
                "부산본점", "부산장림", "사천", "센텀시티", "양산물금", "엠비씨네(진주)", "오투(부산대)",
                "울산(백화점)", "울산성남", "진주혁신(롯데몰)", "진해", "창원", "통영", "프리미엄경남대",
                "프리미엄해운대(장산역)"
        ));
        regionMap.put("강원", Arrays.asList(
                "강릉", "남원주", "동해", "속초", "원주무실", "춘천"
        ));
        regionMap.put("제주", Arrays.asList(
                "서귀포", "제주연동"
        ));

        return regionMap;
    }
}
